[
  {
    "text": "Black pepper and beef go so well together and in \nthis Chinese takeaway inspired black pepper beef,",
    "start": 0.16,
    "duration": 5.92
  },
  {
    "text": "the pepper lifts the dish and gives it a \nbackground warmth without the need for any chillies. ",
    "start": 6.08,
    "duration": 5.44
  },
  {
    "text": "We've got tender beef vibrant colourful \nvegetables all enrobed in a rich savory sauce.",
    "start": 11.52,
    "duration": 6.32
  },
  {
    "text": "Hi I'm Nicky, welcome back to our kitchen where \nwe show you how to make delicious family-friendly  ",
    "start": 21.36,
    "duration": 4.88
  },
  {
    "text": "recipes. I do love a good stir fry, they can be \na super quick midweek meal or you can make them  ",
    "start": 26.24,
    "duration": 6.32
  },
  {
    "text": "something extra special for a treat dinner, and \nthis black pepper beef for me falls into the  ",
    "start": 32.56,
    "duration": 5.04
  },
  {
    "text": "latter category so let's get cooking. We're going \nto start by seasoning the steak. Now because this  ",
    "start": 37.6,
    "duration": 5.36
  },
  {
    "text": "is a little bit of a treat dinner I'm using 450 \ngrams or about a pound of sirloin steak. Now for  ",
    "start": 42.96,
    "duration": 6.4
  },
  {
    "text": "the seasoning we're going to be using quite a lot \nof black pepper in this dish both now and later on  ",
    "start": 49.36,
    "duration": 4.72
  },
  {
    "text": "in the sauce, but don't be put off by the amount \nof pepper in there it combines really well with  ",
    "start": 54.08,
    "duration": 5.04
  },
  {
    "text": "the other flavors and it mellows to give a nice \nwarming peppery heat. So add a teaspoon of freshly  ",
    "start": 59.12,
    "duration": 7.44
  },
  {
    "text": "ground black pepper and quarter of a teaspoon \nof salt and mix it all together to coat the beef.",
    "start": 66.56,
    "duration": 5.28
  },
  {
    "text": "Now heat three tablespoons of sunflower oil \nand a teaspoon of sesame oil in a wok until hot.",
    "start": 75.92,
    "duration": 9.92
  },
  {
    "text": "Add the seasoned steak to the wok \nand cook on a high heat for about  ",
    "start": 89.12,
    "duration": 3.12
  },
  {
    "text": "two to three minutes until the steak's browned.",
    "start": 92.24,
    "duration": 7.6
  },
  {
    "text": "Right that steak looks perfect so we're \ngoing to transfer it to a bowl for later.",
    "start": 103.52,
    "duration": 3.28
  },
  {
    "text": "Now add another tablespoon \nof sunflower oil to the wok.",
    "start": 112.24,
    "duration": 2.4
  },
  {
    "text": "Add in two roughly sliced onions and a \nroughly sliced red pepper and green pepper.",
    "start": 117.6,
    "duration": 4.48
  },
  {
    "text": "Stir fry for three to four \nminutes until starting to soften.",
    "start": 124.24,
    "duration": 3.6
  },
  {
    "text": "Whilst they're cooking we're going to make the \nsauce, so take a jug and add two tablespoons  ",
    "start": 132.48,
    "duration": 4.0
  },
  {
    "text": "of corn flour or cornstarch, next in goes two \ntablespoons of dark soy sauce, two tablespoons  ",
    "start": 136.48,
    "duration": 9.52
  },
  {
    "text": "of oyster sauce, a tablespoon of chinese rice \nwine, 120 mil or half a cup of beef stock  ",
    "start": 146.0,
    "duration": 6.64
  },
  {
    "text": "and one teaspoon of black pepper.",
    "start": 153.68,
    "duration": 2.16
  },
  {
    "text": "Mix that all together until \ncombined and then leave to one side.",
    "start": 158.72,
    "duration": 2.96
  },
  {
    "text": "After the onions have started to \nsoften add in two cloves of minced  ",
    "start": 169.36,
    "duration": 3.44
  },
  {
    "text": "garlic and a teaspoon of minced \nginger and cook for one minute.",
    "start": 172.8,
    "duration": 11.04
  },
  {
    "text": "Now add that sauce from earlier to the pan, stir \neverything together and bring to a gentle simmer.",
    "start": 186.0,
    "duration": 4.16
  },
  {
    "text": "Add the steak back to the wok with the peppers \nand onions and allow the steak to heat through  ",
    "start": 197.28,
    "duration": 4.8
  },
  {
    "text": "and stir to coat in that rich velvety sauce.",
    "start": 202.08,
    "duration": 2.8
  },
  {
    "text": "Then serve the black pepper beef with \nsome boiled rice or egg fried rice. ",
    "start": 206.8,
    "duration": 3.36
  },
  {
    "text": "And that's my version of black pepper beef a \ngreat beef stir fry for a Friday night dinner.  ",
    "start": 211.52,
    "duration": 5.68
  },
  {
    "text": "And instead of chillies we're using black \npepper to give a subtle warmth to the dish  ",
    "start": 217.2,
    "duration": 4.64
  },
  {
    "text": "which works so well with that steak. If you like \nthis recipe then please check out this playlist  ",
    "start": 221.84,
    "duration": 6.0
  },
  {
    "text": "with some of our other favorite Chinese \ntakeaway inspired dishes, see you next time.",
    "start": 227.84,
    "duration": 4.64
  }
]