[
  {
    "text": "Today I am super excited to be participating\nin KIN Community's New Year, New You Collaboration!",
    "start": 0.149,
    "duration": 5.341
  },
  {
    "text": "Now for this collaboration dozens of YouTubers\nhave gotten together to post a new video every",
    "start": 5.49,
    "duration": 5.649
  },
  {
    "text": "day through January with tips and tricks for\nmaking 2015 your best year yet. For my part",
    "start": 11.139,
    "duration": 5.671
  },
  {
    "text": "in this collaboration I'm sharing one of my\nvery favorite recipes that is perfect for",
    "start": 16.81,
    "duration": 4.61
  },
  {
    "text": "#MeatlessMonday. Now this year I am really\nconcentrating on trying to eat less meat,",
    "start": 21.42,
    "duration": 4.81
  },
  {
    "text": "and participating in #MeatlessMonday is a\ngreat way to do that. It's good for the environment,",
    "start": 26.23,
    "duration": 4.4
  },
  {
    "text": "it's good for your wallet and it's certainly\ngreat for your health. Today I'm going to",
    "start": 30.63,
    "duration": 3.69
  },
  {
    "text": "share with you my recipe for my delicious\nblack bean soup, and the coolest part is it",
    "start": 34.32,
    "duration": 5.58
  },
  {
    "text": "all cooks up in your slow cooker so it's super\nsimple, you can just set it and forget it.",
    "start": 39.9,
    "duration": 5.5
  },
  {
    "text": "For this beautiful soup I'm going to get started\nwith some red onion some celery and some diced",
    "start": 45.4,
    "duration": 4.85
  },
  {
    "text": "red bell pepper. Now you have two options\nhere you can either dump these veggies straight",
    "start": 50.25,
    "duration": 4.21
  },
  {
    "text": "into your slow cooker, that will totally work,\nor if you want to get a deeper flavor you",
    "start": 54.46,
    "duration": 4.67
  },
  {
    "text": "can saute them first on the stove, that's\nwhat I'm going to do today. So I've just got",
    "start": 59.13,
    "duration": 4.61
  },
  {
    "text": "some oil heating up in a frying pan and to\nthat I'm going to add my veggies. To this",
    "start": 63.74,
    "duration": 3.66
  },
  {
    "text": "I'm going to be adding some minced garlic\nand some minced jalapeno. Now if you don't",
    "start": 67.4,
    "duration": 4.68
  },
  {
    "text": "like the heat you could totally leave the\njalapeno out but I totally enjoy the heat",
    "start": 72.08,
    "duration": 4.41
  },
  {
    "text": "so I'm going to go for it. We're going to\nsaute these for another 30 seconds and then",
    "start": 76.49,
    "duration": 3.87
  },
  {
    "text": "we are going to add our spices. Now I love\nto toast my spices before they go into the",
    "start": 80.36,
    "duration": 3.7
  },
  {
    "text": "slow cooker because the flavor gets a lot\ndeeper and richer. So I am toasting up some",
    "start": 84.06,
    "duration": 5.31
  },
  {
    "text": "cumin some chili powder and a little bit of\noregano. I'm going to heat these spices up",
    "start": 89.37,
    "duration": 4.12
  },
  {
    "text": "for another 30 seconds and then I'm just going\nto deglaze the pan using some vegetable stock.",
    "start": 93.49,
    "duration": 5.18
  },
  {
    "text": "I'm going to pour with whole mixture into\nmy slow cooker and then I'm going to build",
    "start": 98.67,
    "duration": 4.58
  },
  {
    "text": "the rest of my black bean soup. For this recipe\nI'm using canned black beans, you could totally",
    "start": 103.25,
    "duration": 3.979
  },
  {
    "text": "use dried black beans as well but you'll want\nto remember to soak them overnight to make",
    "start": 107.229,
    "duration": 3.971
  },
  {
    "text": "sure they soften up enough. If you are using\ncanned black beans you can just dump the entire",
    "start": 111.2,
    "duration": 4.65
  },
  {
    "text": "can straight into the slow cooker, you don't\nhave to worry about rinsing or draining them.",
    "start": 115.85,
    "duration": 3.86
  },
  {
    "text": "So I'm adding my black beans to my slow cooker\nand to that I'm going to add some salsa. Now",
    "start": 119.71,
    "duration": 5.199
  },
  {
    "text": "you could totally use just plain diced tomatoes\nthat will work just as well but I find that",
    "start": 124.909,
    "duration": 5.03
  },
  {
    "text": "adding salsa adds even more delicious flavor\nto the final soup. Super Good! And then the",
    "start": 129.939,
    "duration": 5.72
  },
  {
    "text": "last step is topping up your slow cooker with\nmore vegetable broth. How amazing does this",
    "start": 135.659,
    "duration": 4.44
  },
  {
    "text": "look, and I can tell you the house smells\nincredible already. All I'm going to do is",
    "start": 140.099,
    "duration": 4.47
  },
  {
    "text": "give this a really good stir, put on the lid\nand then set my slow cooker for 6-8 hours.",
    "start": 144.569,
    "duration": 5.34
  },
  {
    "text": "Of course the longer this simmers the more\ndelicious it's going to be. Once your soup",
    "start": 149.909,
    "duration": 5.16
  },
  {
    "text": "is ready you can use an immersion blender\nto puree it. Now if you don't have an immersion",
    "start": 155.069,
    "duration": 3.71
  },
  {
    "text": "blender like this don't sweat it at all you\ncould totally use a traditional blender as",
    "start": 158.779,
    "duration": 3.77
  },
  {
    "text": "well but I will tell you, you need to be very\nvery cautious when you are blending hot liquids.",
    "start": 162.549,
    "duration": 5.83
  },
  {
    "text": "So, watch this video for full directions on\nthe safe way to blend hot soup. You just want",
    "start": 168.379,
    "duration": 7.0
  },
  {
    "text": "to make sure that this is in the soup before\nyou start blending otherwise you can make",
    "start": 175.59,
    "duration": 4.739
  },
  {
    "text": "quite a big mess. Now I like to only puree\nit half way so it's got that smooth rich texture",
    "start": 180.329,
    "duration": 6.52
  },
  {
    "text": "but it also still has some chunks of black\nbeans. That's the best way as far as I'm concerned!",
    "start": 186.849,
    "duration": 5.89
  },
  {
    "text": "Now that our soup is pureed we're just going\nto add one more delicious element. We're going",
    "start": 192.739,
    "duration": 4.42
  },
  {
    "text": "to squeeze the juice of two limes into our\nsoup. This is going to give it a really refreshing",
    "start": 197.159,
    "duration": 5.64
  },
  {
    "text": "tangy flavor. I promise you that you do not\nwant to skip this step. We're going to give",
    "start": 202.799,
    "duration": 3.991
  },
  {
    "text": "this a good stir and then it's time to serve\nour soup. I like topping mine with a little",
    "start": 206.79,
    "duration": 3.989
  },
  {
    "text": "bit of sour cream, some fresh avocado slices\nand some fresh cilantro. How amazing does",
    "start": 210.779,
    "duration": 7.0
  },
  {
    "text": "this look. Totally effortless to put together\nand the final result could not be more delicious.",
    "start": 219.48,
    "duration": 7.0
  },
  {
    "text": "I hope you'll give this tasty recipe a try\nand if you do be sure to tweet or instagram",
    "start": 226.919,
    "duration": 4.011
  },
  {
    "text": "me a photo because you know I love seeing\nwhat you're coming up with in your very own",
    "start": 230.93,
    "duration": 3.559
  },
  {
    "text": "kitchens. And of course be sure to check out\nall of the other awesome videos in this New",
    "start": 234.489,
    "duration": 4.521
  },
  {
    "text": "Year, New You collaboration, you will not\nregret i!",
    "start": 239.01,
    "duration": 3.309
  }
]